import { processContent, WordReducer } from "./utils/Words";

const content = `
ספיר נחום (23) נעדרת מביתה מיום חמישי בבוקר. היא נראתה לאחרונה זמן קצר לאחר שהכניסה את בתה בת השנתיים למעון בעיר, ולאחר מכן תועדה נכנסת לרכבו של אבי ילדיה - המוכר כ"כוכב טיקטוק". הוא נעצר בחשד שהוא יודע מה עלה בגורלה
ספיר נחום (23) מעכו, אם לפעוטה כבת שנתיים ותינוק בן 8 חודשים, נעדרת מביתה מאז יום חמישי בבוקר - ומקורביה חוששים לחייה. אבי ילדיה, תושב עכו בשנות ה-30 לחייו, נעצר בחשד שהוא יודע מה עלה בגורלה.
ביום חמישי יצאה נחום מביתה ברחוב הרצל בעכו. אחותה, עדן, סיפרה כי הייתה אמורה לחזור בתוך זמן קצר לביתה – אולם לא הגיעה. המשטרה עורבה בהיעדרות כאשר התמשכה. בתוך זמן קצר, אותרו צילומים ממצלמות אבטחה באזור המעון, בו נראתה הצעירה נכנסת לרכב השייך לאבי ילדיה. היא נכנסה ויצאה מהרכב, וייתכן שנכנסה פעם נוספת, למושב האחורי.
"אני לא אהבתי את הקשר ביניהם והתנגדתי אליו", סיפרה האחות. "לא ידעתי שהם חזרו להיות ביחד, אבל היא סיפרה על זה למטפלת במעון. כשהם היו ביחד לא היו להם בעיות. הם התייחסו מאוד יפה אחד לשני. עם זאת, בתקופה האחרונה היו להם בעיות כי הוא לא שילם מזונות. הם היו אמורים להיפגש בתקופה הקרובה אצל עורך דין".
בן הזוג מוכר למשטרה מעבירות אלימות וונדליזם, ומוכר גם לציבור היות שהוא מתעד את פעולותיו בטיקטוק. לאחרונה נעצר (ושוחרר) לאחר שנכנס יחד עם שישה מחבריו עם עגלה וסוסים לקיבוץ כפר מסריק הסמוך לעכו - והשתולל במקום.
במשטרה אומרים כי הוא עצור בחשד שהוא מעורב בהיעלמותה של הצעירה, ויודע היכן היא נמצאת. "המשטרה ממשיכה בפעולות לאיתורה של הנעדרת, כאשר נערכו חיפושים נרחבים ברחבי העיר וסביבתה, לצד הפעלת יחידות מבצעיות שונות ובהם יחידות הפרשים, הכלבנים, יחידת הג'יפים, רחפנים ומסוק. הופצו תמונות הנעדרת לגורמים הרלוונטיים וכן בוצעו פעולות סמויות וגלויות במישור החקירתי".
`;

const wordReducer = new WordReducer();

processContent(content, wordReducer);
